{
  "architectures": [
    "AndesVLForConditionalGeneration"
  ],
  "auto_map": {
    "AutoConfig": "configuration_andesvl.AndesVLConfig",
    "AutoModel": "modeling_andesvl.AndesVLForConditionalGeneration",
    "AutoModelForCausalLM": "modeling_andesvl.AndesVLForConditionalGeneration"
  },
  "model_type": "andesvl-aimv2-qwen3",
  "text_config": {
    "vocab_size": 151936,
    "max_position_embeddings": 40960,
    "hidden_size": 1024,
    "intermediate_size": 3072,
    "num_hidden_layers": 28,
    "num_attention_heads": 16,
    "use_sliding_window": false,
    "sliding_window": null,
    "max_window_layers": 28,
    "num_key_value_heads": 8,
    "head_dim": 128,
    "hidden_act": "silu",
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-06,
    "use_cache": true,
    "rope_theta": 1000000,
    "rope_scaling": null,
    "attention_bias": false,
    "attention_dropout": 0.0,
    "tie_word_embeddings": true,
    "architectures": [
      "Qwen3ForCausalLM"
    ],
    "bos_token_id": 151643,
    "eos_token_id": 151645,
    "model_type": "qwen3"
  },
  "vision_config": {
    "attention_dropout": 0.0,
    "disable_rope": false,
    "fullatt_block_indexes": null,
    "hidden_size": 1024,
    "hidden_stride": 2,
    "image_size": 448,
    "intermediate_size": 2816,
    "interpolate_pe_method": "two_dim",
    "model_type": "aimv2",
    "num_attention_heads": 8,
    "num_channels": 3,
    "num_hidden_layers": 24,
    "patch_size": 14,
    "preserve_original_pe": true,
    "projection_dropout": 0.0,
    "qkv_bias": false,
    "rms_norm_eps": 1e-05,
    "temporal_patch_size": 1,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.51.0",
    "use_bias": false,
    "window_size": 112
  },
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.51.0"
}